# Assignment 1: Data Parsing, Cleansing and Integration
## Task 3
#### Student Name: NGOC BAO VY LE
#### Student ID: S3828276

Date: 01 SEP 2021

Version: 1.0

Environment: Python 3 and Jupyter notebook

##  Import libraries

In [1]:
import pandas as pd
import re
import numpy as np
import datetime

### 1. Examining and loading data

#### Data 1

In [2]:
df1 = pd.read_csv('S3828276_dataset1_solution.csv')
df1.head()

,ID,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,71851622,Accounts Payable Team Lead w/Oracle €****k,UK,Adecco Group,non_specificed,permanent,Accounting & Finance Jobs,47500.0,2013-01-12 00:00:00,2013-03-13 00:00:00,totaljobs.com
1,69170699,Head of IT/ IT Manager,UK,Senitor Associates,non_specificed,permanent,IT Jobs,47500.0,2013-12-15 12:00:00,2014-03-15 12:00:00,totaljobs.com
2,68701057,Business Development Manager Marketing/Digital,UK,Pure Recruitment,non_specificed,permanent,"PR, Advertising & Marketing Jobs",32500.0,2013-07-06 00:00:00,2013-09-04 00:00:00,totaljobs.com
3,65183561,Project/Design Engineer,Wales,Hunter Selection,non_specificed,permanent,Engineering Jobs,27500.0,2013-09-16 15:00:00,2013-10-16 15:00:00,totaljobs.com
4,68712637,Italian and/or Spanish Inside Sales Representa...,London,Euro London Appointments London,non_specificed,permanent,Sales Jobs,32500.0,2012-04-04 15:00:00,2012-07-03 15:00:00,totaljobs.com

In [3]:
df1.shape

(50693, 11)

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50693 entries, 0 to 50692
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            50693 non-null  int64
 1   Title         50693 non-null  object
 2   Location      50693 non-null  object
 3   Company       50693 non-null  object
 4   ContractType  50693 non-null  object
 5   ContractTime  50693 non-null  object
 6   Category      50693 non-null  object
 7   Salary        50693 non-null  float64
 8   OpenDate      50693 non-null  object
 9   CloseDate     50693 non-null  object
 10  SourceName    50693 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.3+ MB

#### Data 2

In [5]:
# data set 2
df2 = pd.read_csv('S3828276_dataset2.csv')
df2.head()

,Job Title,Organisation,Monthly Payment,Contract Type,Category,Closing,Location,Full-Time Equivalent (FTE),Opening
0,Nursing Home Manager Thames Ditton,Liquid Personnel Ltd,2750.00,NaN,Healthcare and Nursing,2013-02-22 15:00:00,Thames Ditton,FULL TIME,2012-12-24 15:00:00
1,Deputy Manager Nursing Home RGN Shrewsbury,Liquid Personnel Ltd,2583.33,NaN,Healthcare and Nursing,2012-11-14 15:00:00,Shrewsbury,FULL TIME,2012-10-15 15:00:00
2,Deputy Manager Nursing Home (RGN) London,Liquid Personnel Ltd,3000.00,NaN,Healthcare and Nursing,2012-12-08 00:00:00,London,FULL TIME,2012-11-08 00:00:00
3,Deputy Manager (RGN) Nursing Home Bristol,Liquid Personnel Ltd,2791.67,NaN,Healthcare and Nursing,2013-01-13 15:00:00,Bristol,FULL TIME,2012-11-14 15:00:00
4,RGN or RMN Wigan,Eden Brown,2240.00,NaN,Healthcare and Nursing,2013-01-24 15:00:00,Wigan,FULL TIME,2012-11-25 15:00:00

In [6]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Job Title                   5000 non-null   object
 1   Organisation                4937 non-null   object
 2   Monthly Payment             5000 non-null   float64
 3   Contract Type               4312 non-null   object
 4   Category                    5000 non-null   object
 5   Closing                     5000 non-null   object
 6   Location                    5000 non-null   object
 7   Full-Time Equivalent (FTE)  643 non-null    object
 8   Opening                     5000 non-null   object
dtypes: float64(1), object(8)
memory usage: 351.7+ KB

### 2. Resolving schema conflicts

#### Conflict 1: Column numbers
Data 2 has 9 columns where data 1 has 11 columns<br>
Data 2 will be added ID and SouceName columns

In [7]:
# Create 2 new columns in data 2
df2['SourceName'] = 'jobhuntlisting.com'

# create an array with the length of data 2 entries and values is integers staring from 72705203 to 72710203
iD = np.array(range(1,df2.shape[0]+1)) +df1.ID.max()

df2['ID'] = iD

#### Conflict 3: column names
The column names of data 2 are different to data set 1 eventhough there are representing the same informations.<br>
All the column names are in data set 2 will be changed according to column names in data set 1

In [8]:
# change the colum names to the same as df1
df2.rename(columns={'Job Title':'Title','Organisation':'Company','Monthly Payment':'Salary',
                    'Contract Type':'ContractType', 'Closing':'CloseDate', 'Full-Time Equivalent (FTE)':'ContractTime',
                   'Opening':'OpenDate'}, inplace=True)
# re-arrange the order of columns in data 2
df2 = df2[['ID','Title', 'Location','Company',  'ContractType', 'ContractTime', 'Category','Salary','OpenDate','CloseDate', 'SourceName' ]]

In [9]:
df2

,ID,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,72705204,Nursing Home Manager Thames Ditton,Thames Ditton,Liquid Personnel Ltd,NaN,FULL TIME,Healthcare and Nursing,2750.00,2012-12-24 15:00:00,2013-02-22 15:00:00,jobhuntlisting.com
1,72705205,Deputy Manager Nursing Home RGN Shrewsbury,Shrewsbury,Liquid Personnel Ltd,NaN,FULL TIME,Healthcare and Nursing,2583.33,2012-10-15 15:00:00,2012-11-14 15:00:00,jobhuntlisting.com
2,72705206,Deputy Manager Nursing Home (RGN) London,London,Liquid Personnel Ltd,NaN,FULL TIME,Healthcare and Nursing,3000.00,2012-11-08 00:00:00,2012-12-08 00:00:00,jobhuntlisting.com
3,72705207,Deputy Manager (RGN) Nursing Home Bristol,Bristol,Liquid Personnel Ltd,NaN,FULL TIME,Healthcare and Nursing,2791.67,2012-11-14 15:00:00,2013-01-13 15:00:00,jobhuntlisting.com
4,72705208,RGN or RMN Wigan,Wigan,Eden Brown,NaN,FULL TIME,Healthcare and Nursing,2240.00,2012-11-25 15:00:00,2013-01-24 15:00:00,jobhuntlisting.com
...,...,...,...,...,...,...,...,...,...,...,...
4995,72710199,Pharmaceutical Analytical Chemist Jobs in Nor...,Northern Ireland,Flame Pharma,Permanent,NaN,Healthcare and Nursing,1916.67,2013-09-24 15:00:00,2013-10-24 15:00:00,jobhuntlisting.com
4996,72710200,Medical Sales Representative South East Essex,UK,The Vacancy Management Company,Fixed Term Contract,NaN,Healthcare and Nursing,1875.00,2012-05-21 12:00:00,2012-06-20 12:00:00,jobhuntlisting.com
4997,72710201,SENIOR PROJECT MANAGER EVENT & EXHIBITION AGENCY,Hertfordshire,Live Recruitment,Permanent,FULL TIME,"PR, Advertising and Marketing",2708.33,2013-11-17 15:00:00,2013-12-17 15:00:00,jobhuntlisting.com
4998,72710202,Curriculum Leader Mathematics,Wrexham,NaN,Permanent,NaN,Teaching,417.17,2012-01-15 12:00:00,2012-03-15 12:00:00,jobhuntlisting.com
4999,72710203,TEACHER OF BUSINESS STUDIES AND LAW,Salisbury,NaN,Fixed Term Contract,NaN,Teaching,1900.00,2013-04-27 15:00:00,2013-05-11 15:00:00,jobhuntlisting.com

#### Conflict 3: Company
Data 2 has missing values as np.Nan where data 1 has missing values as non-specified

In [10]:
# check missing values in data 2
df2.Company.isna().sum()

63

In [11]:
# Change missing values to non_specificed
df2.loc[df2.Company.isna(), 'Company'] = 'non_specificed'

#### Conflict 4: values of ContractType of data 2 are not same as values of ContractType in data 1
data 2 has Permanent, Fixed Term Contract and missing values where data 1 has permanent, contract and non-specified <br>

In [12]:
df2.ContractType.value_counts()

Permanent              3720
Fixed Term Contract     592
Name: ContractType, dtype: int64

In [13]:
# check for missing values in data 2
df2.ContractType.isna().sum()

688

In [14]:
# change the values in data 2 according to data 1
df2.loc[df2.ContractType == 'Permanent', 'ContractType']= 'permanent'
df2.loc[df2.ContractType == 'Fixed Term Contract', 'ContractType']= 'contract'
df2.loc[df2.ContractType.isna(), 'ContractType']= 'non-specified'

#### Conflict 5: ContractTime
Data 2 has FULL TIME, (0.2 to 0.8) FTE and missing values where Data 1 has full_time, part_time and non-specified<br>
values type data 2 will be changed according to data 1

In [15]:
df2['ContractTime'].isna().sum()

4357

In [16]:
df2['ContractTime'].value_counts()

FULL TIME    583
0.2 FTE       16
0.6 FTE       15
0.4 FTE       15
0.8 FTE       14
Name: ContractTime, dtype: int64

In [17]:
# change missing value to 'non-specified'
missing_value = df2[df2.ContractTime.isna()].index
df2.loc[missing_value, 'ContractTime']= 'non-specified'

In [18]:
# change FULL TIME to full_time
df2.loc[df2.ContractTime == 'FULL TIME', 'ContractTime']= 'full_time'

In [19]:
# change other value to part time

# filter full_time and non-specified
parttime = df2.ContractTime == 'full_time'
non_specified = df2.ContractTime == 'non-specified'

# if not full time or non-specified, they are part time
df2.loc[(~parttime) & (~non_specified), 'ContractTime']= 'part_time'

#### Conflict 6: Category
data 2 has Information Technology, Engineering,Healthcare and Nursing , Finance and Accounting, Sales, Hospitality and Catering, Teaching and PR, Advertising and Marketing <br>
where data 1 has these categorical types worded differently

In [20]:
print('Data 1')
df1.Category.value_counts()

Data 1

IT Jobs                             13131
Healthcare & Nursing Jobs            8184
Engineering Jobs                     7199
Accounting & Finance Jobs            6800
Sales Jobs                           4741
Hospitality & Catering Jobs          4528
Teaching Jobs                        3558
PR, Advertising & Marketing Jobs     2552
Name: Category, dtype: int64

In [21]:
df2.Category.isna().sum()

0

In [22]:
df2.Category.value_counts()

Information Technology           1286
Engineering                      1066
Healthcare and Nursing            655
Finance and Accounting            637
Sales                             630
Hospitality and Catering          275
Teaching                          234
PR, Advertising and Marketing     217
Name: Category, dtype: int64

In [23]:
# change these values in data 2 according to data 1

df2.loc[df2.Category == 'Information Technology', 'Category' ] = 'IT Jobs'

df2.loc[df2.Category == 'Engineering', 'Category' ] = 'Engineering Jobs'

df2.loc[df2.Category == 'Healthcare and Nursing', 'Category' ] = 'Healthcare & Nursing Jobs'

df2.loc[df2.Category == 'Finance and Accounting', 'Category' ] = 'Accounting & Finance Jobs'

df2.loc[df2.Category == 'Sales', 'Category' ] = 'Sales Jobs'

df2.loc[df2.Category == 'Hospitality and Catering', 'Category' ] = 'Hospitality & Catering Jobs'

df2.loc[df2.Category == 'Teaching', 'Category' ] = 'Teaching Jobs'

df2.loc[df2.Category == 'PR, Advertising and Marketing', 'Category' ] = 'PR, Advertising & Marketing Jobs'

#### Conflict 7: Salary
Data 2 has salary columns as object where data 1 has salary as integer<br>
covert salary in data 2 into integer

In [24]:
#df2.Salary = df2['Salary'].astype('float')

In [25]:
df2.Salary

0       2750.00
1       2583.33
2       3000.00
3       2791.67
4       2240.00
         ...
4995    1916.67
4996    1875.00
4997    2708.33
4998     417.17
4999    1900.00
Name: Salary, Length: 5000, dtype: float64

### 3. Merging data

In [26]:
# merge 2 data 
df = pd.concat([df1, df2], ignore_index=True)

In [27]:
df.shape

(55693, 11)

In [28]:
df.tail()

,ID,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
55688,72710199,Pharmaceutical Analytical Chemist Jobs in Nor...,Northern Ireland,Flame Pharma,permanent,non-specified,Healthcare & Nursing Jobs,1916.67,2013-09-24 15:00:00,2013-10-24 15:00:00,jobhuntlisting.com
55689,72710200,Medical Sales Representative South East Essex,UK,The Vacancy Management Company,contract,non-specified,Healthcare & Nursing Jobs,1875.00,2012-05-21 12:00:00,2012-06-20 12:00:00,jobhuntlisting.com
55690,72710201,SENIOR PROJECT MANAGER EVENT & EXHIBITION AGENCY,Hertfordshire,Live Recruitment,permanent,full_time,"PR, Advertising & Marketing Jobs",2708.33,2013-11-17 15:00:00,2013-12-17 15:00:00,jobhuntlisting.com
55691,72710202,Curriculum Leader Mathematics,Wrexham,non_specificed,permanent,non-specified,Teaching Jobs,417.17,2012-01-15 12:00:00,2012-03-15 12:00:00,jobhuntlisting.com
55692,72710203,TEACHER OF BUSINESS STUDIES AND LAW,Salisbury,non_specificed,contract,non-specified,Teaching Jobs,1900.00,2013-04-27 15:00:00,2013-05-11 15:00:00,jobhuntlisting.com

### 4. Resolving data conflicts:

#### conflict 1: duplicates
As merging 2 data together without the common key, we have the result of 55701 records. It does not eliminate duplicates.

In [29]:
# find duplicates by all columns
print('There is no duplicate detected using all columns')
duplicates = df[df.duplicated(keep=False)]
duplicates

There is no duplicate detected using all columns

Empty DataFrame
Columns: [ID, Title, Location, Company, ContractType, ContractTime, Category, Salary, OpenDate, CloseDate, SourceName]
Index: []

In [30]:
# using location , compay, contractType, contractTime, opendate
print('this does not seem right')

cols = cols = ['Location','Company','ContractType','ContractTime', 'OpenDate']

duplicates = df[df.duplicated(cols,keep=False)]
duplicates

this does not seem right

,ID,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
1540,68708304,Transfer Pricing Consultant,UK,Michael Page Finance,non_specificed,permanent,Accounting & Finance Jobs,42500.0,2013-02-17 00:00:00,2013-05-18 00:00:00,totaljobs.com
2364,68062485,Sales Account Manager Print Media and Events,South East London,The Graduate Recruitment Company,non_specificed,permanent,Sales Jobs,22500.0,2013-06-14 12:00:00,2013-09-12 12:00:00,totaljobs.com
2622,68063683,Russian Speaking Account Manager Financial Tr...,South East London,The Graduate Recruitment Company,non_specificed,permanent,Sales Jobs,18500.0,2013-06-14 12:00:00,2013-07-14 12:00:00,totaljobs.com
2913,68696242,Business Transformation & Change Manager Home...,UK,Additional Resources Ltd,non_specificed,permanent,IT Jobs,57500.0,2012-03-03 15:00:00,2012-04-02 15:00:00,totaljobs.com
3035,68708336,Group Finance Accountant,UK,Michael Page Finance,non_specificed,permanent,Accounting & Finance Jobs,57500.0,2013-02-17 00:00:00,2013-04-18 00:00:00,totaljobs.com
...,...,...,...,...,...,...,...,...,...,...,...
50065,69896138,Support Worker ( Children and Young People ),UK,non-specified,non_specificed,permanent,Healthcare & Nursing Jobs,13670.0,2012-12-06 00:00:00,2013-01-05 00:00:00,jobstoday.co.uk
50617,68197924,Sales Manager Ad Serving Technology,London,Ultimate Asset,full_time,permanent,"PR, Advertising & Marketing Jobs",37500.0,2013-06-02 12:00:00,2013-08-01 12:00:00,jobs.chinwag.com
50630,69956247,Sales Account Manager award winning publisher,London,Ultimate Asset,full_time,permanent,"PR, Advertising & Marketing Jobs",31500.0,2013-06-02 12:00:00,2013-08-31 12:00:00,jobs.chinwag.com
50681,69035689,"Civil Engineer, Onshore Windfarm Development",UK,Morgan Hunt Limited,non_specificed,permanent,Engineering Jobs,35000.0,2013-09-13 12:00:00,2013-10-13 12:00:00,renewablescareers.com
50688,68061181,"Civil Engineer, Onshore Windfarm Development",UK,Morgan Hunt Limited,non_specificed,permanent,Engineering Jobs,35000.0,2013-09-13 12:00:00,2013-10-13 12:00:00,renewablescareers.com

In [31]:
# using title, company, salary to check for duplicates

cols = cols = ['Title', 'Company', 'Salary']

duplicates = df[df.duplicated(cols,keep=False)]
print('there are', len(duplicates), 'duplicates')
duplicates

there are 6 duplicates

,ID,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
36493,68822514,C ASPNet Developer Basingstoke ****k To ****k,Basingstoke,Progressive Recruitment,non_specificed,non_specificed,IT Jobs,37500.0,2013-02-12 00:00:00,2013-02-26 00:00:00,gojobsearch.co.uk
36838,68061163,C ASPNet Developer Basingstoke ****k To ****k,Basingstoke,Progressive Recruitment,non_specificed,non_specificed,IT Jobs,37500.0,2013-02-12 00:00:00,2013-02-26 00:00:00,gojobsearch.co.uk
41938,71844696,Primary Teacher Vacancies Rotherham,Rotherham,ITN Mark Education,non_specificed,non_specificed,Teaching Jobs,25200.0,2012-10-08 00:00:00,2012-11-07 00:00:00,contractjobs.com
42009,68061172,Primary Teacher Vacancies Rotherham,Rotherham,ITN Mark Education,non_specificed,non_specificed,Teaching Jobs,25200.0,2012-10-08 00:00:00,2012-11-07 00:00:00,contractjobs.com
48362,69896148,Theatre Nurses,Liverpool,JS3 Recruitment Ltd,non_specificed,permanent,Healthcare & Nursing Jobs,28500.0,2013-06-26 15:00:00,2013-08-25 15:00:00,tntjobs.co.uk
48466,68061190,Theatre Nurses,Liverpool,JS3 Recruitment Ltd,non_specificed,permanent,Healthcare & Nursing Jobs,28500.0,2013-06-26 15:00:00,2013-08-25 15:00:00,tntjobs.co.uk

In [32]:
# # using location, company, salary and opendate to check for duplicates
print('these recods are repeated')
cols = cols = ['Location', 'Company',  'Salary',  'OpenDate']

duplicates = df[df.duplicated(cols,keep=False)]
print(len(duplicates), 'recodes are found')
duplicates

these recods are repeated
8 recodes are found

,ID,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
36493,68822514,C ASPNet Developer Basingstoke ****k To ****k,Basingstoke,Progressive Recruitment,non_specificed,non_specificed,IT Jobs,37500.0,2013-02-12 00:00:00,2013-02-26 00:00:00,gojobsearch.co.uk
36838,68061163,C ASPNet Developer Basingstoke ****k To ****k,Basingstoke,Progressive Recruitment,non_specificed,non_specificed,IT Jobs,37500.0,2013-02-12 00:00:00,2013-02-26 00:00:00,gojobsearch.co.uk
41938,71844696,Primary Teacher Vacancies Rotherham,Rotherham,ITN Mark Education,non_specificed,non_specificed,Teaching Jobs,25200.0,2012-10-08 00:00:00,2012-11-07 00:00:00,contractjobs.com
42009,68061172,Primary Teacher Vacancies Rotherham,Rotherham,ITN Mark Education,non_specificed,non_specificed,Teaching Jobs,25200.0,2012-10-08 00:00:00,2012-11-07 00:00:00,contractjobs.com
48362,69896148,Theatre Nurses,Liverpool,JS3 Recruitment Ltd,non_specificed,permanent,Healthcare & Nursing Jobs,28500.0,2013-06-26 15:00:00,2013-08-25 15:00:00,tntjobs.co.uk
48466,68061190,Theatre Nurses,Liverpool,JS3 Recruitment Ltd,non_specificed,permanent,Healthcare & Nursing Jobs,28500.0,2013-06-26 15:00:00,2013-08-25 15:00:00,tntjobs.co.uk
50681,69035689,"Civil Engineer, Onshore Windfarm Development",UK,Morgan Hunt Limited,non_specificed,permanent,Engineering Jobs,35000.0,2013-09-13 12:00:00,2013-10-13 12:00:00,renewablescareers.com
50688,68061181,"Civil Engineer, Onshore Windfarm Development",UK,Morgan Hunt Limited,non_specificed,permanent,Engineering Jobs,35000.0,2013-09-13 12:00:00,2013-10-13 12:00:00,renewablescareers.com

#### fixing duplicates:
There are 8 recodes detected when checking for duplicates. The last version is kept, so 4 are removed.

In [33]:
# keep the last duplicates
df = df.drop_duplicates(cols, keep='last')
print('after dropping duplicates, the data set has', df.shape[0], 'observations')
df.shape

after dropping duplicates, the data set has 55689 observations

(55689, 11)

......

#### Finding global key for the data : the set of Location, Company,  Salary and OpenDate
A job ad belongs to a company at a paticular location.
A job ad also has a salary and an open date.<br>
We need the set of Location, Company,  Salary and OpenDate to identify an job ad.<br>
Therefore the set of Location, Company,  Salary and OpenDate is the global key of the data set

.......

### 5. Saving the integrated and reshaped data

In [34]:
df.to_csv('S3828276_dataset_integrated.csv', index=False)

## Summary of the Assessment Task
task 3 is about data integration. Before merging 2 data sets, we need to make sure they share the same schema.<br>
As data 1 is the global schema, data 2 needs to be adapted to match the global schema.<br>
Data 2 was added ID and sourceName columns and values in each column were edited according to the data 1.<br>
After merging 2 data sets together, duplicates were detected by using the global key (Company, location, salary, opendate).<br>
Duplicates were droped before the combined data is exported into csv file.